tutorials/stenosisPipe/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|  Stenosis pipe v4 -- BBPA paper §3 same-trajectory validation case          |
|                                                                             |
|  D = 5 mm circular pipe, L = 200 mm, 75% area cosine stenosis at x = 100 mm |
|  Stenosis half-length L_half = 10 mm (taper width 20 mm)                    |
|                                                                             |
|  Mesh: ~256_088 cells, structured O-grid                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1.0;

vertices
(
        (0.0000000e+00 1.2500000e-03 -1.2500000e-03)
        (0.0000000e+00 1.2500000e-03 1.2500000e-03)
        (0.0000000e+00 -1.2500000e-03 1.2500000e-03)
        (0.0000000e+00 -1.2500000e-03 -1.2500000e-03)
        (0.0000000e+00 1.7677670e-03 -1.7677670e-03)
        (0.0000000e+00 1.7677670e-03 1.7677670e-03)
        (0.0000000e+00 -1.7677670e-03 1.7677670e-03)
        (0.0000000e+00 -1.7677670e-03 -1.7677670e-03)
        (9.0000000e-02 1.2500000e-03 -1.2500000e-03)
        (9.0000000e-02 1.2500000e-03 1.2500000e-03)
        (9.0000000e-02 -1.2500000e-03 1.2500000e-03)
        (9.0000000e-02 -1.2500000e-03 -1.2500000e-03)
        (9.0000000e-02 1.7677670e-03 -1.7677670e-03)
        (9.0000000e-02 1.7677670e-03 1.7677670e-03)
        (9.0000000e-02 -1.7677670e-03 1.7677670e-03)
        (9.0000000e-02 -1.7677670e-03 -1.7677670e-03)
        (9.1000000e-02 1.2347052e-03 -1.2347052e-03)
        (9.1000000e-02 1.2347052e-03 1.2347052e-03)
        (9.1000000e-02 -1.2347052e-03 1.2347052e-03)
        (9.1000000e-02 -1.2347052e-03 -1.2347052e-03)
        (9.1000000e-02 1.7461368e-03 -1.7461368e-03)
        (9.1000000e-02 1.7461368e-03 1.7461368e-03)
        (9.1000000e-02 -1.7461368e-03 1.7461368e-03)
        (9.1000000e-02 -1.7461368e-03 -1.7461368e-03)
        (9.2000000e-02 1.1903178e-03 -1.1903178e-03)
        (9.2000000e-02 1.1903178e-03 1.1903178e-03)
        (9.2000000e-02 -1.1903178e-03 1.1903178e-03)
        (9.2000000e-02 -1.1903178e-03 -1.1903178e-03)
        (9.2000000e-02 1.6833636e-03 -1.6833636e-03)
        (9.2000000e-02 1.6833636e-03 1.6833636e-03)
        (9.2000000e-02 -1.6833636e-03 1.6833636e-03)
        (9.2000000e-02 -1.6833636e-03 -1.6833636e-03)
        (9.3000000e-02 1.1211829e-03 -1.1211829e-03)
        (9.3000000e-02 1.1211829e-03 1.1211829e-03)
        (9.3000000e-02 -1.1211829e-03 1.1211829e-03)
        (9.3000000e-02 -1.1211829e-03 -1.1211829e-03)
        (9.3000000e-02 1.5855921e-03 -1.5855921e-03)
        (9.3000000e-02 1.5855921e-03 1.5855921e-03)
        (9.3000000e-02 -1.5855921e-03 1.5855921e-03)
        (9.3000000e-02 -1.5855921e-03 -1.5855921e-03)
        (9.4000000e-02 1.0340678e-03 -1.0340678e-03)
        (9.4000000e-02 1.0340678e-03 1.0340678e-03)
        (9.4000000e-02 -1.0340678e-03 1.0340678e-03)
        (9.4000000e-02 -1.0340678e-03 -1.0340678e-03)
        (9.4000000e-02 1.4623927e-03 -1.4623927e-03)
        (9.4000000e-02 1.4623927e-03 1.4623927e-03)
        (9.4000000e-02 -1.4623927e-03 1.4623927e-03)
        (9.4000000e-02 -1.4623927e-03 -1.4623927e-03)
        (9.5000000e-02 9.3750000e-04 -9.3750000e-04)
        (9.5000000e-02 9.3750000e-04 9.3750000e-04)
        (9.5000000e-02 -9.3750000e-04 9.3750000e-04)
        (9.5000000e-02 -9.3750000e-04 -9.3750000e-04)
        (9.5000000e-02 1.3258252e-03 -1.3258252e-03)
        (9.5000000e-02 1.3258252e-03 1.3258252e-03)
        (9.5000000e-02 -1.3258252e-03 1.3258252e-03)
        (9.5000000e-02 -1.3258252e-03 -1.3258252e-03)
        (9.6000000e-02 8.4093219e-04 -8.4093219e-04)
        (9.6000000e-02 8.4093219e-04 8.4093219e-04)
        (9.6000000e-02 -8.4093219e-04 8.4093219e-04)
        (9.6000000e-02 -8.4093219e-04 -8.4093219e-04)
        (9.6000000e-02 1.1892577e-03 -1.1892577e-03)
        (9.6000000e-02 1.1892577e-03 1.1892577e-03)
        (9.6000000e-02 -1.1892577e-03 1.1892577e-03)
        (9.6000000e-02 -1.1892577e-03 -1.1892577e-03)
        (9.7000000e-02 7.5381711e-04 -7.5381711e-04)
        (9.7000000e-02 7.5381711e-04 7.5381711e-04)
        (9.7000000e-02 -7.5381711e-04 7.5381711e-04)
        (9.7000000e-02 -7.5381711e-04 -7.5381711e-04)
        (9.7000000e-02 1.0660584e-03 -1.0660584e-03)
        (9.7000000e-02 1.0660584e-03 1.0660584e-03)
        (9.7000000e-02 -1.0660584e-03 1.0660584e-03)
        (9.7000000e-02 -1.0660584e-03 -1.0660584e-03)
        (9.8000000e-02 6.8468219e-04 -6.8468219e-04)
        (9.8000000e-02 6.8468219e-04 6.8468219e-04)
        (9.8000000e-02 -6.8468219e-04 6.8468219e-04)
        (9.8000000e-02 -6.8468219e-04 -6.8468219e-04)
        (9.8000000e-02 9.6828684e-04 -9.6828684e-04)
        (9.8000000e-02 9.6828684e-04 9.6828684e-04)
        (9.8000000e-02 -9.6828684e-04 9.6828684e-04)
        (9.8000000e-02 -9.6828684e-04 -9.6828684e-04)
        (9.9000000e-02 6.4029484e-04 -6.4029484e-04)
        (9.9000000e-02 6.4029484e-04 6.4029484e-04)
        (9.9000000e-02 -6.4029484e-04 6.4029484e-04)
        (9.9000000e-02 -6.4029484e-04 -6.4029484e-04)
        (9.9000000e-02 9.0551364e-04 -9.0551364e-04)
        (9.9000000e-02 9.0551364e-04 9.0551364e-04)
        (9.9000000e-02 -9.0551364e-04 9.0551364e-04)
        (9.9000000e-02 -9.0551364e-04 -9.0551364e-04)
        (1.0000000e-01 6.2500000e-04 -6.2500000e-04)
        (1.0000000e-01 6.2500000e-04 6.2500000e-04)
        (1.0000000e-01 -6.2500000e-04 6.2500000e-04)
        (1.0000000e-01 -6.2500000e-04 -6.2500000e-04)
        (1.0000000e-01 8.8388348e-04 -8.8388348e-04)
        (1.0000000e-01 8.8388348e-04 8.8388348e-04)
        (1.0000000e-01 -8.8388348e-04 8.8388348e-04)
        (1.0000000e-01 -8.8388348e-04 -8.8388348e-04)
        (1.0100000e-01 6.4029484e-04 -6.4029484e-04)
        (1.0100000e-01 6.4029484e-04 6.4029484e-04)
        (1.0100000e-01 -6.4029484e-04 6.4029484e-04)
        (1.0100000e-01 -6.4029484e-04 -6.4029484e-04)
        (1.0100000e-01 9.0551364e-04 -9.0551364e-04)
        (1.0100000e-01 9.0551364e-04 9.0551364e-04)
        (1.0100000e-01 -9.0551364e-04 9.0551364e-04)
        (1.0100000e-01 -9.0551364e-04 -9.0551364e-04)
        (1.0200000e-01 6.8468219e-04 -6.8468219e-04)
        (1.0200000e-01 6.8468219e-04 6.8468219e-04)
        (1.0200000e-01 -6.8468219e-04 6.8468219e-04)
        (1.0200000e-01 -6.8468219e-04 -6.8468219e-04)
        (1.0200000e-01 9.6828684e-04 -9.6828684e-04)
        (1.0200000e-01 9.6828684e-04 9.6828684e-04)
        (1.0200000e-01 -9.6828684e-04 9.6828684e-04)
        (1.0200000e-01 -9.6828684e-04 -9.6828684e-04)
        (1.0300000e-01 7.5381711e-04 -7.5381711e-04)
        (1.0300000e-01 7.5381711e-04 7.5381711e-04)
        (1.0300000e-01 -7.5381711e-04 7.5381711e-04)
        (1.0300000e-01 -7.5381711e-04 -7.5381711e-04)
        (1.0300000e-01 1.0660584e-03 -1.0660584e-03)
        (1.0300000e-01 1.0660584e-03 1.0660584e-03)
        (1.0300000e-01 -1.0660584e-03 1.0660584e-03)
        (1.0300000e-01 -1.0660584e-03 -1.0660584e-03)
        (1.0400000e-01 8.4093219e-04 -8.4093219e-04)
        (1.0400000e-01 8.4093219e-04 8.4093219e-04)
        (1.0400000e-01 -8.4093219e-04 8.4093219e-04)
        (1.0400000e-01 -8.4093219e-04 -8.4093219e-04)
        (1.0400000e-01 1.1892577e-03 -1.1892577e-03)
        (1.0400000e-01 1.1892577e-03 1.1892577e-03)
        (1.0400000e-01 -1.1892577e-03 1.1892577e-03)
        (1.0400000e-01 -1.1892577e-03 -1.1892577e-03)
        (1.0500000e-01 9.3750000e-04 -9.3750000e-04)
        (1.0500000e-01 9.3750000e-04 9.3750000e-04)
        (1.0500000e-01 -9.3750000e-04 9.3750000e-04)
        (1.0500000e-01 -9.3750000e-04 -9.3750000e-04)
        (1.0500000e-01 1.3258252e-03 -1.3258252e-03)
        (1.0500000e-01 1.3258252e-03 1.3258252e-03)
        (1.0500000e-01 -1.3258252e-03 1.3258252e-03)
        (1.0500000e-01 -1.3258252e-03 -1.3258252e-03)
        (1.0600000e-01 1.0340678e-03 -1.0340678e-03)
        (1.0600000e-01 1.0340678e-03 1.0340678e-03)
        (1.0600000e-01 -1.0340678e-03 1.0340678e-03)
        (1.0600000e-01 -1.0340678e-03 -1.0340678e-03)
        (1.0600000e-01 1.4623927e-03 -1.4623927e-03)
        (1.0600000e-01 1.4623927e-03 1.4623927e-03)
        (1.0600000e-01 -1.4623927e-03 1.4623927e-03)
        (1.0600000e-01 -1.4623927e-03 -1.4623927e-03)
        (1.0700000e-01 1.1211829e-03 -1.1211829e-03)
        (1.0700000e-01 1.1211829e-03 1.1211829e-03)
        (1.0700000e-01 -1.1211829e-03 1.1211829e-03)
        (1.0700000e-01 -1.1211829e-03 -1.1211829e-03)
        (1.0700000e-01 1.5855921e-03 -1.5855921e-03)
        (1.0700000e-01 1.5855921e-03 1.5855921e-03)
        (1.0700000e-01 -1.5855921e-03 1.5855921e-03)
        (1.0700000e-01 -1.5855921e-03 -1.5855921e-03)
        (1.0800000e-01 1.1903178e-03 -1.1903178e-03)
        (1.0800000e-01 1.1903178e-03 1.1903178e-03)
        (1.0800000e-01 -1.1903178e-03 1.1903178e-03)
        (1.0800000e-01 -1.1903178e-03 -1.1903178e-03)
        (1.0800000e-01 1.6833636e-03 -1.6833636e-03)
        (1.0800000e-01 1.6833636e-03 1.6833636e-03)
        (1.0800000e-01 -1.6833636e-03 1.6833636e-03)
        (1.0800000e-01 -1.6833636e-03 -1.6833636e-03)
        (1.0900000e-01 1.2347052e-03 -1.2347052e-03)
        (1.0900000e-01 1.2347052e-03 1.2347052e-03)
        (1.0900000e-01 -1.2347052e-03 1.2347052e-03)
        (1.0900000e-01 -1.2347052e-03 -1.2347052e-03)
        (1.0900000e-01 1.7461368e-03 -1.7461368e-03)
        (1.0900000e-01 1.7461368e-03 1.7461368e-03)
        (1.0900000e-01 -1.7461368e-03 1.7461368e-03)
        (1.0900000e-01 -1.7461368e-03 -1.7461368e-03)
        (1.1000000e-01 1.2500000e-03 -1.2500000e-03)
        (1.1000000e-01 1.2500000e-03 1.2500000e-03)
        (1.1000000e-01 -1.2500000e-03 1.2500000e-03)
        (1.1000000e-01 -1.2500000e-03 -1.2500000e-03)
        (1.1000000e-01 1.7677670e-03 -1.7677670e-03)
        (1.1000000e-01 1.7677670e-03 1.7677670e-03)
        (1.1000000e-01 -1.7677670e-03 1.7677670e-03)
        (1.1000000e-01 -1.7677670e-03 -1.7677670e-03)
        (1.6000000e-01 1.2500000e-03 -1.2500000e-03)
        (1.6000000e-01 1.2500000e-03 1.2500000e-03)
        (1.6000000e-01 -1.2500000e-03 1.2500000e-03)
        (1.6000000e-01 -1.2500000e-03 -1.2500000e-03)
        (1.6000000e-01 1.7677670e-03 -1.7677670e-03)
        (1.6000000e-01 1.7677670e-03 1.7677670e-03)
        (1.6000000e-01 -1.7677670e-03 1.7677670e-03)
        (1.6000000e-01 -1.7677670e-03 -1.7677670e-03)
        (2.0000000e-01 1.2500000e-03 -1.2500000e-03)
        (2.0000000e-01 1.2500000e-03 1.2500000e-03)
        (2.0000000e-01 -1.2500000e-03 1.2500000e-03)
        (2.0000000e-01 -1.2500000e-03 -1.2500000e-03)
        (2.0000000e-01 1.7677670e-03 -1.7677670e-03)
        (2.0000000e-01 1.7677670e-03 1.7677670e-03)
        (2.0000000e-01 -1.7677670e-03 1.7677670e-03)
        (2.0000000e-01 -1.7677670e-03 -1.7677670e-03)
);

blocks
(
    hex (0 1 2 3 8 9 10 11) (6 6 63) simpleGrading (1 1 1)  // slab 0 inner
    hex (0 4 5 1 8 12 13 9) (2 6 63) simpleGrading (0.2 1 1)  // slab 0 E_arc
    hex (1 5 6 2 9 13 14 10) (2 6 63) simpleGrading (0.2 1 1)  // slab 0 N_arc
    hex (2 6 7 3 10 14 15 11) (2 6 63) simpleGrading (0.2 1 1)  // slab 0 W_arc
    hex (3 7 4 0 11 15 12 8) (2 6 63) simpleGrading (0.2 1 1)  // slab 0 S_arc
    hex (8 9 10 11 16 17 18 19) (6 6 2) simpleGrading (1 1 1)  // slab 1 inner
    hex (8 12 13 9 16 20 21 17) (2 6 2) simpleGrading (0.2 1 1)  // slab 1 E_arc
    hex (9 13 14 10 17 21 22 18) (2 6 2) simpleGrading (0.2 1 1)  // slab 1 N_arc
    hex (10 14 15 11 18 22 23 19) (2 6 2) simpleGrading (0.2 1 1)  // slab 1 W_arc
    hex (11 15 12 8 19 23 20 16) (2 6 2) simpleGrading (0.2 1 1)  // slab 1 S_arc
    hex (16 17 18 19 24 25 26 27) (6 6 2) simpleGrading (1 1 1)  // slab 2 inner
    hex (16 20 21 17 24 28 29 25) (2 6 2) simpleGrading (0.2 1 1)  // slab 2 E_arc
    hex (17 21 22 18 25 29 30 26) (2 6 2) simpleGrading (0.2 1 1)  // slab 2 N_arc
    hex (18 22 23 19 26 30 31 27) (2 6 2) simpleGrading (0.2 1 1)  // slab 2 W_arc
    hex (19 23 20 16 27 31 28 24) (2 6 2) simpleGrading (0.2 1 1)  // slab 2 S_arc
    hex (24 25 26 27 32 33 34 35) (6 6 2) simpleGrading (1 1 1)  // slab 3 inner
    hex (24 28 29 25 32 36 37 33) (2 6 2) simpleGrading (0.2 1 1)  // slab 3 E_arc
    hex (25 29 30 26 33 37 38 34) (2 6 2) simpleGrading (0.2 1 1)  // slab 3 N_arc
    hex (26 30 31 27 34 38 39 35) (2 6 2) simpleGrading (0.2 1 1)  // slab 3 W_arc
    hex (27 31 28 24 35 39 36 32) (2 6 2) simpleGrading (0.2 1 1)  // slab 3 S_arc
    hex (32 33 34 35 40 41 42 43) (6 6 2) simpleGrading (1 1 1)  // slab 4 inner
    hex (32 36 37 33 40 44 45 41) (2 6 2) simpleGrading (0.2 1 1)  // slab 4 E_arc
    hex (33 37 38 34 41 45 46 42) (2 6 2) simpleGrading (0.2 1 1)  // slab 4 N_arc
    hex (34 38 39 35 42 46 47 43) (2 6 2) simpleGrading (0.2 1 1)  // slab 4 W_arc
    hex (35 39 36 32 43 47 44 40) (2 6 2) simpleGrading (0.2 1 1)  // slab 4 S_arc
    hex (40 41 42 43 48 49 50 51) (6 6 2) simpleGrading (1 1 1)  // slab 5 inner
    hex (40 44 45 41 48 52 53 49) (2 6 2) simpleGrading (0.2 1 1)  // slab 5 E_arc
    hex (41 45 46 42 49 53 54 50) (2 6 2) simpleGrading (0.2 1 1)  // slab 5 N_arc
    hex (42 46 47 43 50 54 55 51) (2 6 2) simpleGrading (0.2 1 1)  // slab 5 W_arc
    hex (43 47 44 40 51 55 52 48) (2 6 2) simpleGrading (0.2 1 1)  // slab 5 S_arc
    hex (48 49 50 51 56 57 58 59) (6 6 2) simpleGrading (1 1 1)  // slab 6 inner
    hex (48 52 53 49 56 60 61 57) (2 6 2) simpleGrading (0.2 1 1)  // slab 6 E_arc
    hex (49 53 54 50 57 61 62 58) (2 6 2) simpleGrading (0.2 1 1)  // slab 6 N_arc
    hex (50 54 55 51 58 62 63 59) (2 6 2) simpleGrading (0.2 1 1)  // slab 6 W_arc
    hex (51 55 52 48 59 63 60 56) (2 6 2) simpleGrading (0.2 1 1)  // slab 6 S_arc
    hex (56 57 58 59 64 65 66 67) (6 6 2) simpleGrading (1 1 1)  // slab 7 inner
    hex (56 60 61 57 64 68 69 65) (2 6 2) simpleGrading (0.2 1 1)  // slab 7 E_arc
    hex (57 61 62 58 65 69 70 66) (2 6 2) simpleGrading (0.2 1 1)  // slab 7 N_arc
    hex (58 62 63 59 66 70 71 67) (2 6 2) simpleGrading (0.2 1 1)  // slab 7 W_arc
    hex (59 63 60 56 67 71 68 64) (2 6 2) simpleGrading (0.2 1 1)  // slab 7 S_arc
    hex (64 65 66 67 72 73 74 75) (6 6 2) simpleGrading (1 1 1)  // slab 8 inner
    hex (64 68 69 65 72 76 77 73) (2 6 2) simpleGrading (0.2 1 1)  // slab 8 E_arc
    hex (65 69 70 66 73 77 78 74) (2 6 2) simpleGrading (0.2 1 1)  // slab 8 N_arc
    hex (66 70 71 67 74 78 79 75) (2 6 2) simpleGrading (0.2 1 1)  // slab 8 W_arc
    hex (67 71 68 64 75 79 76 72) (2 6 2) simpleGrading (0.2 1 1)  // slab 8 S_arc
    hex (72 73 74 75 80 81 82 83) (6 6 2) simpleGrading (1 1 1)  // slab 9 inner
    hex (72 76 77 73 80 84 85 81) (2 6 2) simpleGrading (0.2 1 1)  // slab 9 E_arc
    hex (73 77 78 74 81 85 86 82) (2 6 2) simpleGrading (0.2 1 1)  // slab 9 N_arc
    hex (74 78 79 75 82 86 87 83) (2 6 2) simpleGrading (0.2 1 1)  // slab 9 W_arc
    hex (75 79 76 72 83 87 84 80) (2 6 2) simpleGrading (0.2 1 1)  // slab 9 S_arc
    hex (80 81 82 83 88 89 90 91) (6 6 2) simpleGrading (1 1 1)  // slab 10 inner
    hex (80 84 85 81 88 92 93 89) (2 6 2) simpleGrading (0.2 1 1)  // slab 10 E_arc
    hex (81 85 86 82 89 93 94 90) (2 6 2) simpleGrading (0.2 1 1)  // slab 10 N_arc
    hex (82 86 87 83 90 94 95 91) (2 6 2) simpleGrading (0.2 1 1)  // slab 10 W_arc
    hex (83 87 84 80 91 95 92 88) (2 6 2) simpleGrading (0.2 1 1)  // slab 10 S_arc
    hex (88 89 90 91 96 97 98 99) (6 6 2) simpleGrading (1 1 1)  // slab 11 inner
    hex (88 92 93 89 96 100 101 97) (2 6 2) simpleGrading (0.2 1 1)  // slab 11 E_arc
    hex (89 93 94 90 97 101 102 98) (2 6 2) simpleGrading (0.2 1 1)  // slab 11 N_arc
    hex (90 94 95 91 98 102 103 99) (2 6 2) simpleGrading (0.2 1 1)  // slab 11 W_arc
    hex (91 95 92 88 99 103 100 96) (2 6 2) simpleGrading (0.2 1 1)  // slab 11 S_arc
    hex (96 97 98 99 104 105 106 107) (6 6 2) simpleGrading (1 1 1)  // slab 12 inner
    hex (96 100 101 97 104 108 109 105) (2 6 2) simpleGrading (0.2 1 1)  // slab 12 E_arc
    hex (97 101 102 98 105 109 110 106) (2 6 2) simpleGrading (0.2 1 1)  // slab 12 N_arc
    hex (98 102 103 99 106 110 111 107) (2 6 2) simpleGrading (0.2 1 1)  // slab 12 W_arc
    hex (99 103 100 96 107 111 108 104) (2 6 2) simpleGrading (0.2 1 1)  // slab 12 S_arc
    hex (104 105 106 107 112 113 114 115) (6 6 2) simpleGrading (1 1 1)  // slab 13 inner
    hex (104 108 109 105 112 116 117 113) (2 6 2) simpleGrading (0.2 1 1)  // slab 13 E_arc
    hex (105 109 110 106 113 117 118 114) (2 6 2) simpleGrading (0.2 1 1)  // slab 13 N_arc
    hex (106 110 111 107 114 118 119 115) (2 6 2) simpleGrading (0.2 1 1)  // slab 13 W_arc
    hex (107 111 108 104 115 119 116 112) (2 6 2) simpleGrading (0.2 1 1)  // slab 13 S_arc
    hex (112 113 114 115 120 121 122 123) (6 6 2) simpleGrading (1 1 1)  // slab 14 inner
    hex (112 116 117 113 120 124 125 121) (2 6 2) simpleGrading (0.2 1 1)  // slab 14 E_arc
    hex (113 117 118 114 121 125 126 122) (2 6 2) simpleGrading (0.2 1 1)  // slab 14 N_arc
    hex (114 118 119 115 122 126 127 123) (2 6 2) simpleGrading (0.2 1 1)  // slab 14 W_arc
    hex (115 119 116 112 123 127 124 120) (2 6 2) simpleGrading (0.2 1 1)  // slab 14 S_arc
    hex (120 121 122 123 128 129 130 131) (6 6 2) simpleGrading (1 1 1)  // slab 15 inner
    hex (120 124 125 121 128 132 133 129) (2 6 2) simpleGrading (0.2 1 1)  // slab 15 E_arc
    hex (121 125 126 122 129 133 134 130) (2 6 2) simpleGrading (0.2 1 1)  // slab 15 N_arc
    hex (122 126 127 123 130 134 135 131) (2 6 2) simpleGrading (0.2 1 1)  // slab 15 W_arc
    hex (123 127 124 120 131 135 132 128) (2 6 2) simpleGrading (0.2 1 1)  // slab 15 S_arc
    hex (128 129 130 131 136 137 138 139) (6 6 2) simpleGrading (1 1 1)  // slab 16 inner
    hex (128 132 133 129 136 140 141 137) (2 6 2) simpleGrading (0.2 1 1)  // slab 16 E_arc
    hex (129 133 134 130 137 141 142 138) (2 6 2) simpleGrading (0.2 1 1)  // slab 16 N_arc
    hex (130 134 135 131 138 142 143 139) (2 6 2) simpleGrading (0.2 1 1)  // slab 16 W_arc
    hex (131 135 132 128 139 143 140 136) (2 6 2) simpleGrading (0.2 1 1)  // slab 16 S_arc
    hex (136 137 138 139 144 145 146 147) (6 6 2) simpleGrading (1 1 1)  // slab 17 inner
    hex (136 140 141 137 144 148 149 145) (2 6 2) simpleGrading (0.2 1 1)  // slab 17 E_arc
    hex (137 141 142 138 145 149 150 146) (2 6 2) simpleGrading (0.2 1 1)  // slab 17 N_arc
    hex (138 142 143 139 146 150 151 147) (2 6 2) simpleGrading (0.2 1 1)  // slab 17 W_arc
    hex (139 143 140 136 147 151 148 144) (2 6 2) simpleGrading (0.2 1 1)  // slab 17 S_arc
    hex (144 145 146 147 152 153 154 155) (6 6 2) simpleGrading (1 1 1)  // slab 18 inner
    hex (144 148 149 145 152 156 157 153) (2 6 2) simpleGrading (0.2 1 1)  // slab 18 E_arc
    hex (145 149 150 146 153 157 158 154) (2 6 2) simpleGrading (0.2 1 1)  // slab 18 N_arc
    hex (146 150 151 147 154 158 159 155) (2 6 2) simpleGrading (0.2 1 1)  // slab 18 W_arc
    hex (147 151 148 144 155 159 156 152) (2 6 2) simpleGrading (0.2 1 1)  // slab 18 S_arc
    hex (152 153 154 155 160 161 162 163) (6 6 2) simpleGrading (1 1 1)  // slab 19 inner
    hex (152 156 157 153 160 164 165 161) (2 6 2) simpleGrading (0.2 1 1)  // slab 19 E_arc
    hex (153 157 158 154 161 165 166 162) (2 6 2) simpleGrading (0.2 1 1)  // slab 19 N_arc
    hex (154 158 159 155 162 166 167 163) (2 6 2) simpleGrading (0.2 1 1)  // slab 19 W_arc
    hex (155 159 156 152 163 167 164 160) (2 6 2) simpleGrading (0.2 1 1)  // slab 19 S_arc
    hex (160 161 162 163 168 169 170 171) (6 6 2) simpleGrading (1 1 1)  // slab 20 inner
    hex (160 164 165 161 168 172 173 169) (2 6 2) simpleGrading (0.2 1 1)  // slab 20 E_arc
    hex (161 165 166 162 169 173 174 170) (2 6 2) simpleGrading (0.2 1 1)  // slab 20 N_arc
    hex (162 166 167 163 170 174 175 171) (2 6 2) simpleGrading (0.2 1 1)  // slab 20 W_arc
    hex (163 167 164 160 171 175 172 168) (2 6 2) simpleGrading (0.2 1 1)  // slab 20 S_arc
    hex (168 169 170 171 176 177 178 179) (6 6 80) simpleGrading (1 1 1)  // slab 21 inner
    hex (168 172 173 169 176 180 181 177) (2 6 80) simpleGrading (0.2 1 1)  // slab 21 E_arc
    hex (169 173 174 170 177 181 182 178) (2 6 80) simpleGrading (0.2 1 1)  // slab 21 N_arc
    hex (170 174 175 171 178 182 183 179) (2 6 80) simpleGrading (0.2 1 1)  // slab 21 W_arc
    hex (171 175 172 168 179 183 180 176) (2 6 80) simpleGrading (0.2 1 1)  // slab 21 S_arc
    hex (176 177 178 179 184 185 186 187) (6 6 32) simpleGrading (1 1 1)  // slab 22 inner
    hex (176 180 181 177 184 188 189 185) (2 6 32) simpleGrading (0.2 1 1)  // slab 22 E_arc
    hex (177 181 182 178 185 189 190 186) (2 6 32) simpleGrading (0.2 1 1)  // slab 22 N_arc
    hex (178 182 183 179 186 190 191 187) (2 6 32) simpleGrading (0.2 1 1)  // slab 22 W_arc
    hex (179 183 180 176 187 191 188 184) (2 6 32) simpleGrading (0.2 1 1)  // slab 22 S_arc
);

edges
(
    arc 4 5 (0.0000000e+00 2.5000000e-03 0.0000000e+00)
    arc 5 6 (0.0000000e+00 0.0000000e+00 2.5000000e-03)
    arc 6 7 (0.0000000e+00 -2.5000000e-03 0.0000000e+00)
    arc 7 4 (0.0000000e+00 0.0000000e+00 -2.5000000e-03)
    arc 12 13 (9.0000000e-02 2.5000000e-03 0.0000000e+00)
    arc 13 14 (9.0000000e-02 0.0000000e+00 2.5000000e-03)
    arc 14 15 (9.0000000e-02 -2.5000000e-03 0.0000000e+00)
    arc 15 12 (9.0000000e-02 0.0000000e+00 -2.5000000e-03)
    arc 20 21 (9.1000000e-02 2.4694103e-03 0.0000000e+00)
    arc 21 22 (9.1000000e-02 0.0000000e+00 2.4694103e-03)
    arc 22 23 (9.1000000e-02 -2.4694103e-03 0.0000000e+00)
    arc 23 20 (9.1000000e-02 0.0000000e+00 -2.4694103e-03)
    arc 28 29 (9.2000000e-02 2.3806356e-03 0.0000000e+00)
    arc 29 30 (9.2000000e-02 0.0000000e+00 2.3806356e-03)
    arc 30 31 (9.2000000e-02 -2.3806356e-03 0.0000000e+00)
    arc 31 28 (9.2000000e-02 0.0000000e+00 -2.3806356e-03)
    arc 36 37 (9.3000000e-02 2.2423658e-03 0.0000000e+00)
    arc 37 38 (9.3000000e-02 0.0000000e+00 2.2423658e-03)
    arc 38 39 (9.3000000e-02 -2.2423658e-03 0.0000000e+00)
    arc 39 36 (9.3000000e-02 0.0000000e+00 -2.2423658e-03)
    arc 44 45 (9.4000000e-02 2.0681356e-03 0.0000000e+00)
    arc 45 46 (9.4000000e-02 0.0000000e+00 2.0681356e-03)
    arc 46 47 (9.4000000e-02 -2.0681356e-03 0.0000000e+00)
    arc 47 44 (9.4000000e-02 0.0000000e+00 -2.0681356e-03)
    arc 52 53 (9.5000000e-02 1.8750000e-03 0.0000000e+00)
    arc 53 54 (9.5000000e-02 0.0000000e+00 1.8750000e-03)
    arc 54 55 (9.5000000e-02 -1.8750000e-03 0.0000000e+00)
    arc 55 52 (9.5000000e-02 0.0000000e+00 -1.8750000e-03)
    arc 60 61 (9.6000000e-02 1.6818644e-03 0.0000000e+00)
    arc 61 62 (9.6000000e-02 0.0000000e+00 1.6818644e-03)
    arc 62 63 (9.6000000e-02 -1.6818644e-03 0.0000000e+00)
    arc 63 60 (9.6000000e-02 0.0000000e+00 -1.6818644e-03)
    arc 68 69 (9.7000000e-02 1.5076342e-03 0.0000000e+00)
    arc 69 70 (9.7000000e-02 0.0000000e+00 1.5076342e-03)
    arc 70 71 (9.7000000e-02 -1.5076342e-03 0.0000000e+00)
    arc 71 68 (9.7000000e-02 0.0000000e+00 -1.5076342e-03)
    arc 76 77 (9.8000000e-02 1.3693644e-03 0.0000000e+00)
    arc 77 78 (9.8000000e-02 0.0000000e+00 1.3693644e-03)
    arc 78 79 (9.8000000e-02 -1.3693644e-03 0.0000000e+00)
    arc 79 76 (9.8000000e-02 0.0000000e+00 -1.3693644e-03)
    arc 84 85 (9.9000000e-02 1.2805897e-03 0.0000000e+00)
    arc 85 86 (9.9000000e-02 0.0000000e+00 1.2805897e-03)
    arc 86 87 (9.9000000e-02 -1.2805897e-03 0.0000000e+00)
    arc 87 84 (9.9000000e-02 0.0000000e+00 -1.2805897e-03)
    arc 92 93 (1.0000000e-01 1.2500000e-03 0.0000000e+00)
    arc 93 94 (1.0000000e-01 0.0000000e+00 1.2500000e-03)
    arc 94 95 (1.0000000e-01 -1.2500000e-03 0.0000000e+00)
    arc 95 92 (1.0000000e-01 0.0000000e+00 -1.2500000e-03)
    arc 100 101 (1.0100000e-01 1.2805897e-03 0.0000000e+00)
    arc 101 102 (1.0100000e-01 0.0000000e+00 1.2805897e-03)
    arc 102 103 (1.0100000e-01 -1.2805897e-03 0.0000000e+00)
    arc 103 100 (1.0100000e-01 0.0000000e+00 -1.2805897e-03)
    arc 108 109 (1.0200000e-01 1.3693644e-03 0.0000000e+00)
    arc 109 110 (1.0200000e-01 0.0000000e+00 1.3693644e-03)
    arc 110 111 (1.0200000e-01 -1.3693644e-03 0.0000000e+00)
    arc 111 108 (1.0200000e-01 0.0000000e+00 -1.3693644e-03)
    arc 116 117 (1.0300000e-01 1.5076342e-03 0.0000000e+00)
    arc 117 118 (1.0300000e-01 0.0000000e+00 1.5076342e-03)
    arc 118 119 (1.0300000e-01 -1.5076342e-03 0.0000000e+00)
    arc 119 116 (1.0300000e-01 0.0000000e+00 -1.5076342e-03)
    arc 124 125 (1.0400000e-01 1.6818644e-03 0.0000000e+00)
    arc 125 126 (1.0400000e-01 0.0000000e+00 1.6818644e-03)
    arc 126 127 (1.0400000e-01 -1.6818644e-03 0.0000000e+00)
    arc 127 124 (1.0400000e-01 0.0000000e+00 -1.6818644e-03)
    arc 132 133 (1.0500000e-01 1.8750000e-03 0.0000000e+00)
    arc 133 134 (1.0500000e-01 0.0000000e+00 1.8750000e-03)
    arc 134 135 (1.0500000e-01 -1.8750000e-03 0.0000000e+00)
    arc 135 132 (1.0500000e-01 0.0000000e+00 -1.8750000e-03)
    arc 140 141 (1.0600000e-01 2.0681356e-03 0.0000000e+00)
    arc 141 142 (1.0600000e-01 0.0000000e+00 2.0681356e-03)
    arc 142 143 (1.0600000e-01 -2.0681356e-03 0.0000000e+00)
    arc 143 140 (1.0600000e-01 0.0000000e+00 -2.0681356e-03)
    arc 148 149 (1.0700000e-01 2.2423658e-03 0.0000000e+00)
    arc 149 150 (1.0700000e-01 0.0000000e+00 2.2423658e-03)
    arc 150 151 (1.0700000e-01 -2.2423658e-03 0.0000000e+00)
    arc 151 148 (1.0700000e-01 0.0000000e+00 -2.2423658e-03)
    arc 156 157 (1.0800000e-01 2.3806356e-03 0.0000000e+00)
    arc 157 158 (1.0800000e-01 0.0000000e+00 2.3806356e-03)
    arc 158 159 (1.0800000e-01 -2.3806356e-03 0.0000000e+00)
    arc 159 156 (1.0800000e-01 0.0000000e+00 -2.3806356e-03)
    arc 164 165 (1.0900000e-01 2.4694103e-03 0.0000000e+00)
    arc 165 166 (1.0900000e-01 0.0000000e+00 2.4694103e-03)
    arc 166 167 (1.0900000e-01 -2.4694103e-03 0.0000000e+00)
    arc 167 164 (1.0900000e-01 0.0000000e+00 -2.4694103e-03)
    arc 172 173 (1.1000000e-01 2.5000000e-03 0.0000000e+00)
    arc 173 174 (1.1000000e-01 0.0000000e+00 2.5000000e-03)
    arc 174 175 (1.1000000e-01 -2.5000000e-03 0.0000000e+00)
    arc 175 172 (1.1000000e-01 0.0000000e+00 -2.5000000e-03)
    arc 180 181 (1.6000000e-01 2.5000000e-03 0.0000000e+00)
    arc 181 182 (1.6000000e-01 0.0000000e+00 2.5000000e-03)
    arc 182 183 (1.6000000e-01 -2.5000000e-03 0.0000000e+00)
    arc 183 180 (1.6000000e-01 0.0000000e+00 -2.5000000e-03)
    arc 188 189 (2.0000000e-01 2.5000000e-03 0.0000000e+00)
    arc 189 190 (2.0000000e-01 0.0000000e+00 2.5000000e-03)
    arc 190 191 (2.0000000e-01 -2.5000000e-03 0.0000000e+00)
    arc 191 188 (2.0000000e-01 0.0000000e+00 -2.5000000e-03)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (3 7 4 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (187 186 185 184)
            (185 189 188 184)
            (186 190 189 185)
            (187 191 190 186)
            (184 188 191 187)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
            (7 4 12 15)
            (12 13 21 20)
            (13 14 22 21)
            (14 15 23 22)
            (15 12 20 23)
            (20 21 29 28)
            (21 22 30 29)
            (22 23 31 30)
            (23 20 28 31)
            (28 29 37 36)
            (29 30 38 37)
            (30 31 39 38)
            (31 28 36 39)
            (36 37 45 44)
            (37 38 46 45)
            (38 39 47 46)
            (39 36 44 47)
            (44 45 53 52)
            (45 46 54 53)
            (46 47 55 54)
            (47 44 52 55)
            (52 53 61 60)
            (53 54 62 61)
            (54 55 63 62)
            (55 52 60 63)
            (60 61 69 68)
            (61 62 70 69)
            (62 63 71 70)
            (63 60 68 71)
            (68 69 77 76)
            (69 70 78 77)
            (70 71 79 78)
            (71 68 76 79)
            (76 77 85 84)
            (77 78 86 85)
            (78 79 87 86)
            (79 76 84 87)
            (84 85 93 92)
            (85 86 94 93)
            (86 87 95 94)
            (87 84 92 95)
            (92 93 101 100)
            (93 94 102 101)
            (94 95 103 102)
            (95 92 100 103)
            (100 101 109 108)
            (101 102 110 109)
            (102 103 111 110)
            (103 100 108 111)
            (108 109 117 116)
            (109 110 118 117)
            (110 111 119 118)
            (111 108 116 119)
            (116 117 125 124)
            (117 118 126 125)
            (118 119 127 126)
            (119 116 124 127)
            (124 125 133 132)
            (125 126 134 133)
            (126 127 135 134)
            (127 124 132 135)
            (132 133 141 140)
            (133 134 142 141)
            (134 135 143 142)
            (135 132 140 143)
            (140 141 149 148)
            (141 142 150 149)
            (142 143 151 150)
            (143 140 148 151)
            (148 149 157 156)
            (149 150 158 157)
            (150 151 159 158)
            (151 148 156 159)
            (156 157 165 164)
            (157 158 166 165)
            (158 159 167 166)
            (159 156 164 167)
            (164 165 173 172)
            (165 166 174 173)
            (166 167 175 174)
            (167 164 172 175)
            (172 173 181 180)
            (173 174 182 181)
            (174 175 183 182)
            (175 172 180 183)
            (180 181 189 188)
            (181 182 190 189)
            (182 183 191 190)
            (183 180 188 191)
        );
    }
);

// ************************************************************************* //