tutorials/stenosisPipe/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions [0 1 -1 0 0 0 0];
internalField uniform (0.3 0 0);
boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue
        {
            type    sine;
            frequency 1;
            amplitude (0.3 0 0);
            scale     (1 1 1);
            level     (0.3 0 0);
        }
    }
    outlet  { type zeroGradient; }
    walls    { type noSlip; }
    allBoundary { type zeroGradient; }
}
