tutorials/stenosisPipe/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
dimensions [0 2 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
    inlet       { type calculated; value uniform 0; }
    outlet      { type calculated; value uniform 0; }
    walls        { type nutkWallFunction; value uniform 0; }
    allBoundary { type calculated; value uniform 0; }
}
